namespace Laboratory_work__1
{
    public partial class TestWindow : Form
    {
        Random rnd = new Random();

        Dictionary<string, int> Data = new Dictionary<string, int>()
        {
            { "Variant", 0 },
            { "Question", 0 },
            { "GoodAnswer", 0 }
        };

        string[,,] questions = {
            { // variant 1
                { // question 1.1
                    "До акумуляторної батареї  із внутрішнім опором RВ = 0,4 Ом " +
                        "ввімкнули лампу розжарювання з опором  RЛ = 11,6 Ом. Струм в колі дорівнює 2,5 А. " +
                        "Визначити ЕРС акумуляторної батареї  і напругу на клемах лампи розжарювання. ",
                    "а) Е = 30 В,U  = 29 В; ",
                    "б) Е = 40 В,U  = 35 В;",
                    "в) Е = 60 В,U  = 56 В;",
                    "г) U  = 208 В,І  = 10 А;",
                    "д) U  = 204 В,І  = 0 А.",
                    "quest_1_1"
                },
                { // question 1.2 
                    "Вкажіть формулу для визначення опору провідника:",
                    "а) R = U/I;",
                    "б) R = ρl/S;",
                    "в) R = P/I^2;",
                    "г) Вірної відповіді немає.",
                    "none",
                    "none"
                },
                { // question 1.3
                    "Визначити  покази  вольтметра,   ватметра  в  електричному  колі  постійного  струму,  " +
                        "якщо Е = 208 В,   RВ = 2 Ом, R1 = 20 Ом, R2 = 30 Ом.",
                    "а) U  = 200 В,Р  = 600 Вт ;",
                    "б) U  = 204 В,Р  = 400 Вт;",
                    "в) U  = 100 В,Р  = 200 Вт;",
                    "г) U  = 150 В,Р  = 300 Вт;",
                    "д) U  = 200 В,Р  = 800 Вт.",
                    "quest_1_3"
                },
                { // question 1.4
                    "Вкажіть схему правильного ввімкнення вимірювальних приладів ( амперметра,  вольтметра,  ватметра )  " +
                        "в електричне коло",
                    "а) Рисунок 1;",
                    "б) Рисунок 2;",
                    "в) Рисунок 3.",
                    "none",
                    "none",
                    "quest_1_4"
                },
                { // question 1.5
                    "Визначити  еквівалентний  опір  електричної  схеми  постійного  струму  до  і  після " +
                        "ввімкнення  вимикача  S1, якщо R1 = 8 Ом, R2 =  R3 =  R4 = 12 Ом. " +
                        "Вкажіть  правильну відповідь:",
                    "а) 14 Ом ,12 Ом;",
                    "б) 16 Ом,48 Ом;",
                    "в) 18 Ом,30 Ом;",
                    "г) 24 Ом,10 Ом;",
                    "д) 6 Ом,3 Ом.",
                    "quest_1_5"
                },
                { // question 1.6 -- 7
                    "Яке з приведених рівнянь відповідає рисунку?  Вкажіть  правильну відповідь:",
                    "а) I1 + I2 - I3 = - I4;",
                    "б) I2 - I4 - I1 - I3 = 0;",
                    "в) I3 + I4 - I1 - I2 = 0;",
                    "г) I1 + I2 + I3 + I4 = 0.",
                    "none",
                    "quest_1_6"
                },
                { // question 1.7 -- 8
                    "Яке з приведених рівнянь відповідає даній електричній схемі (контур1)? Вкажіть  правильну відповідь:",
                    "а) I2 (R2 + R4) – I5 R5 = –E2;",
                    "б) I1 (R1 + R3 + R5) – I5 R5 = E2;",
                    "в) I1 R1 + I5 (R2 + R4 + R5)  = E1;",
                    "г)  –I1 (R1 + R3) – I5 R5 = –E1. ",
                    "none",
                    "quest_1_7"
                },
                { // question 1.8 -- 9
                    "Електричне коло постійного струму споживає потужність Р = 4800 Вт. " +
                        "Відомі опори  R1 = 24 Ом, R2 = 60 Ом, R3 = 40 Ом. Визначити струм  І2 та " +
                        "напругу U мережі живлення. Вкажіть правильну відповідь:",
                    "а) І2 = 4 А,U = 320 В;",
                    "б) І2 = 10 А,U = 48 В;",
                    "в) І2 = 5 А,U = 120 В;",
                    "г) І2 = 4 А,U = 480 В.",
                    "none",
                    "quest_1_9"
                }
            },
            { // variant 2
                { // question 2.1
                    "До акумуляторної батареї  із внутрішнім опором RВ = 0,6 Ом ввімкнули лампу " +
                        "розжарювання з опором  RЛ = 11,4 Ом. Струм в колі дорівнює 2,5 А. Визначити ЕРС " +
                        "акумуляторної батареї  і напругу на клемах лампи розжарювання." +
                        "Вкажіть  правильну відповідь:",
                    "а) Е = 30 В,U = 28,5 В; ",
                    "б) Е = 40 В,U = 30 В;",
                    "в) Е = 60 В,U = 23 В;",
                    "г) U = 208 В,І = 1 А;",
                    "д) U  = 204 В,І = 10 А",
                    "quest_1_1"
                },
                { // question 2.2 
                    "В електричному колі постійного струму при розімкненому вимикачі S1 покази вольтметра дорівнюють " +
                        "12 В, а при замкнутому – 10 В. Покази амперметра І = 2 А. Визначити опір навантаження R1, " +
                        "струм короткого замикання Iкз.",
                    "а) R1 = 5 Ом,Iкз = 12А;",
                    "б) R1 = 4 Ом,Iкз = 2А;",
                    "в) R1 = 10 Ом,Iкз =1А;",
                    "г) R1 = 15 Ом,   Iкз =10А.",
                    "none",
                    "quest_2_2"
                },
                { // question 2.3
                    "Визначте  покази  вольтметра  в  електричному  колі постійного струму, внутрішній " +
                        "опір джерела живлення RВ, якщо Е = 208 В, R1 = 20 Ом, R2 = 30 Ом, ватметр " +
                        "показує 800 Вт. Вкажіть правильну відповідь:",
                    "а) U = 200 В,RВ = 2 Ом;",
                    "б) U = 208 В,RВ = 1 Ом;",
                    "в) U = 100 В,RВ = 2 Ом;",
                    "г) U = 200 В,RВ = 8 Ом.",
                    "none",
                    "quest_1_3"
                },
                { // question 2.4
                    "Вкажіть схему правильного ввімкнення вимірювальних приладів " +
                        "( амперметра,  вольтметра,  ватметра )  в електричне коло. " +
                        "Вкажіть правильну відповідь:",
                    "а) Рисунок 1;",
                    "б) Рисунок 2;",
                    "в) Рисунок 3.",
                    "none",
                    "none",
                    "quest_1_4"
                },
                { // question 2.5
                    "Визначити  еквівалентний  опір  електричної  схеми   постійного  струму  до  " +
                        "ввімкнення   вимикача S1, якщо   R1 =  12 Ом , R2 =R3 =R4 = R5 = 6 Ом. " +
                        "Вкажіть  правильну відповідь:",
                    "а) 48 Ом;",
                    "б) 4 Ом;",
                    "в) 36 Ом;",
                    "г) 14 Ом;",
                    "д) 6 Ом.",
                    "quest_2_5"
                },
                { // question 2.6
                    "Вкажіть  правильне визначення другого закону Кірхгофа . Алгебраїчна  сума " +
                        "Чому дорівнює ЕРС контура.Вкажіть  правильну відповідь:",
                    "а) Алгебраїчній сумі струмів контура;",
                    "б) Алгебраїчній сумі  спаду напруг на елементах контура;",
                    "в) Алгебраїчній сумі спаду ЕРС контура;",
                    "г) Алгебраїчній сумі струмів, що входять у вузол",
                    "none",
                    "none"
                },
                { // question 2.7
                    "Яке з приведених рівнянь відповідає рисунку? Вкажіть  правильну відповідь:",
                    "а) I3 + I4 - I1 - I2 = 0;",
                    "б) I1 + I2 - I3 = - I4;",
                    "в) I1 + I4  - I2 - I3 = 0;",
                    "г) I1 + I2 + I3 + I4 = 0.",
                    "none",
                    "quest_2_6"
                },
                { // question 2.8
                    "Яке з приведених рівнянь відповідає даній електричній схемі (контур1)? " +
                        "Вкажіть  правильну відповідь:",
                    "а) I2 (R2 + R4) – I5 R5 = –E2;",
                    "б) I1 (R1 + R3 + R5) – I5 R5 = E2;",
                    "в) I1 R1 + I5 (R2 + R4 + R5) = E1;",
                    "г)  – I1 (R1 + R3) – I5 R5 = –E1.",
                    "none",
                    "quest_1_9"
                }
            },
            { // variant 3
                { // question 3.1
                    "В електричному колі постійного струму при розімкненому вимикачі S1 " +
                        "покази вольтметра дорівнюють 12 В, а при замкнутому – 10 В. " +
                        "Покази амперметра І = 2 А. Визначити опір навантаження R1,  " +
                        "струм короткого замикання Iкз",
                    "а) R1 = 5 Ом,Iкз = 12А;",
                    "б) R1 = 4 Ом,Iкз = 2А;",
                    "в) R1 = 10 Ом,Iкз = 1А;",
                    "г) R1 = 15 Ом,Iкз = 10А.",
                    "none",
                    "quest_2_2"
                },
                { // question 3.2 
                    "Визначити еквівалентний опір електричної схеми до ввімкнення вимикача  S1, " +
                        "якщо  R1 =  R2 =  R3 =  R. Вкажіть правильну відповідь:",
                    "а) 3R;",
                    "б) R / 3;",
                    "в) 2R / 3;",
                    "г) 4R / 3;",
                    "д) 3R / 2.",
                    "quest_3_2"
                },
                { // question 3.3
                    "Якими даними необхідно володіти, щоб визначити довжину витка дроту, " +
                        "не розмотуючи його? Вкажіть  правильну відповідь:",
                    "а) U, I, S;",
                    "б) U, S, ρ;",
                    "в) I, S, ρ;",
                    "г)U, I, S, ρ",
                    "none",
                    "none"
                },
                { // question 3.4
                    "Визначте  покази  вольтметра  в  електричному  колі постійного струму, внутрішній  опір " +
                        "джерела живлення RВ, якщо Е = 208 В, R1 = 20 Ом, R2 = 30 Ом, ватметр показує 800 Вт. " +
                        "Вкажіть правильну відповідь:",
                    "а) U = 200 В,RВ = 2 Ом;",
                    "б) U = 208 В,RВ = 1 Ом;",
                    "в) U = 100 В,RВ = 2 Ом;",
                    "г) U = 200 В,RВ = 8 Ом.",
                    "none",
                    "quest_1_3"
                },
                { // question 3.5
                    "Визначити  еквівалентний  опір  електричної  схеми  постійного  струму  до  і  " +
                        "після  ввімкнення  вимикача  S1, якщо R1 = 4 Ом, R2 =  R3 =  R4 = 12 Ом. " +
                        "Вкажіть  правильну відповідь:",
                    "а) 30 Ом,8 Ом;",
                    "б) 48Ом,16 Ом;",
                    "в) 16 Ом,8 Ом;",
                    "г) 3 Ом,12 Ом.",
                    "none",
                    "quest_3_5"
                },
                { // question 3.6
                    "Який з провідників однакового перерізу і виготовлений з одного і того ж матеріалу, " +
                        "але різної довжини, сильніше нагріється при одному і тому ж струмі? " +
                        "Вкажіть  правильну відповідь:",
                    "а) Коротший;",
                    "б) Довший;",
                    "в) Обидва провідники нагріваються однаково;",
                    "г) Кількість теплоти буде рівна нулю.",
                    "none",
                    "none"
                },
                { // question 3.7
                    "Яке з приведених рівнянь відповідає рисунку? Вкажіть  правильну відповідь:",
                    "а) -I1 - I2 - I3 - I4 = 0; ",
                    "б) I1 + I2 - I3 = - I4; ",
                    "в) I3 + I4 - I1 - I2 = 0; ",
                    "г) I1 - I2 + I3 + I4 = 0.",
                    "none",
                    "quest_3_7"
                },
                { // question 3.8
                    "Яке з приведених рівнянь відповідає даній електричній схемі (контур 2)? Вкажіть  правильну відповідь:",
                    "а)  I1 (R1 + R3) + I5 R5 = E1; ",
                    "б)  I1 (R1 + R3 + R5) – I5 R5 = E2;",
                    "в)  I1 R1 + I5 (R2 + R4 + R5)  = E1;",
                    "г)  I2 (R2 + R4) – I5 R5 = –E2.",
                    "none",
                    "quest_1_7"
                }
            },
            { // variant 4
                { // question 4.1
                    "У залежності від положення перемикача прилади показують: вольтметр 2,2 В " +
                        "( вимикач S1 – розімкнений ), амперметр 1 А ( вимикач S1 – ввімкнений). " +
                        "Який внутрішній опір RВ джерела  ЕРС, якщо R1 =  2 Ом? Вкажіть  правильну відповідь:",
                    "а) 0,2 Ом;",
                    "б) 0;",
                    "в) 1,1Ом;",
                    "г) 2,2 Ом.",
                    "none",
                    "quest_4_1"
                },
                { // question 4.2 
                    "Визначити  покази  вольтметра,   ватметра  в  електричному  колі  " +
                        "постійного  струму, якщо Е = 208 В,RВ = 2 Ом, R1 = 20 Ом, R2 = 30 Ом. " +
                        "Вкажіть  правильну відповідь:",
                    "а) U = 200 В,Р = 600 Вт ;",
                    "б) U = 204 В,Р = 400 Вт;",
                    "в) U = 100 В,Р = 200 Вт ;",
                    "г) U = 150 В,Р = 300 Вт;",
                    "д) U = 200 В,Р = 800 Вт.",
                    "quest_1_3"
                },
                { // question 4.3
                    "Визначити  еквівалентний  опір  електричної схеми постійного  струму  до  ввімкнення " +
                        "вимикача S1, якщо R1 = 12 Ом ,R2 =R3 =R4 = R5 = 6 Ом. Вкажіть  правильну відповідь:",
                    "а) 48 Ом;",
                    "б) 4 Ом;",
                    "в) 36 Ом;",
                    "г) 14 Ом;",
                    "д) 6 Ом.",
                    "quest_2_5"
                },
                { // question 4.4
                    "Щодня працювали протягом 16 год.  електродвигун вентилятора потужністю 2,0 кВт " +
                        "і протягом 8 год. 40 електроламп потужністю по 100 Вт кожна. Визначити кількість " +
                        "спожитої електроенергії і її вартість за 25 днів роботи при тарифі 15 коп. " +
                        "за 1 кВт • год. Вкажіть  правильну відповідь:",
                    "а) W = 880 кВт •год., П = 5866,66 гривень;",
                    "б) W = 1600 кВт•год., П = 240 гривень;",
                    "в) W = 880 кВт •год., П = 132 гривені;",
                    "г) W = 1200 кВт •год., П = 180гривень",
                    "none",
                    "none"
                },
                { // question 4.5
                    "Як зміниться струм в електричному колі постійного струму, якщо вольтметр помилково " +
                        "ввімкнути послідовно з навантаженням R1 (  Внутрішній опір вольтметра дорівнює  ∞) ? " +
                        "Вкажіть  правильну відповідь:",
                    "а) Дорівнюватиме  нулю;",
                    "б) Залишиться незмінним;",
                    "в) Збільшиться;",
                    "г) Зменшиться.",
                    "none",
                    "quest_4_5"
                },
                { // question 4.6
                    "Яке з приведених рівнянь відповідає рисунку? Вкажіть  правильну відповідь:",
                    "а) I1 + I2 + I4 = I3;",
                    "б) I1 - I2 - I3 = - I4;",
                    "в) I3 + I4 - I1 - I2 = 0;",
                    "г) I1 + I2 + I3 + I4 = 0.",
                    "none",
                    "quest_4_6"
                },
                { // question 4.7
                    "Потужність кожної лампи Р = 40 Вт. Визначити потужність, яку споживає електричне коло " +
                        "постійного струму. Вимикач S1- розімкнений. Потужність, яка витрачається на " +
                        "внутрішньому опорі джерела живлення не враховувати.",
                    "а) Р = 120 Вт;",
                    "б) Р = 160 Вт;",
                    "в) Р = 40 Вт;",
                    "г) Р = 80 Вт.",
                    "none",
                    "quest_4_7"
                },
                { // question 4.8
                    "Яке з приведених рівнянь відповідає даній електричній схемі (контур1)? Вкажіть  правильну відповідь:",
                    "а) I2 (R2 + R4) – I5 R5 = –E2;",
                    "б)  I1 (R1 + R3 + R5) – I5 R5 = E2;",
                    "в)  I1 R1 + I5 (R2 + R4 + R5)  = E1;",
                    "г)  – I1 (R1 + R3) – I5 R5 = –E1.",
                    "none",
                    "quest_1_7"
                }
            },
            { // variant 5
                { // question 5.1
                    "Яку напругу покаже вольтметр до ввімкнення вимикача S1, якщо ЕРС постійного струму Е = 204 В," +
                        " RВ = 1 Ом, R1 = 50 Ом ? Вкажіть  правильну відповідь:",
                    "а) U = 200 В;",
                    "б) U = 204 В;",
                    "в) U = 220 В;",
                    "г) U = 260 В;",
                    "д) U  = 0 В.",
                    "quest_2_2"
                },
                { // question 5.2 
                    "Визначте покази амперметра А1, вольтметра та ЕРС електричної схеми постійного струму, якщо " +
                        "RВ = 2 Ом;R1 =  R2 = 8 Ом; Р = 100 Вт. Вкажіть  правильну відповідь:",
                    "а) І = 5А, U = 20 В, Е = 30 В;",
                    "б) І = 4А, U = 10 В, Е = 30 В;",
                    "в) І = 2,5А, U = 20 В, Е = 40 В;",
                    "г) І = 10А, U = 30 В, Е = 20 В;",
                    "д) І = 5А, U = 10 В, Е = 30 В.",
                    "quest_5_2"
                },
                { // question 5.3
                    "Вкажіть схему правильного ввімкнення вимірювальних приладів ( амперметра,  вольтметра, " +
                        "ватметра ) в електричне коло. Вкажіть  правильну відповідь:",
                    "а) Рисунок 1;",
                    "б) Рисунок 2;",
                    "в) Рисунок 3.",
                    "none",
                    "none",
                    "quest_1_4"
                },
                { // question 5.4
                    "Щодня працювали протягом 16 год.  електродвигун вентилятора потужністю 2,0 кВт і " +
                        "протягом 8 год. 40 електроламп потужністю по 100 Вт кожна. Визначити кількість " +
                        "спожитої електроенергії і її вартість за 25 днів роботи при тарифі 15 коп. за 1 кВт • год." +
                        " Вкажіть  правильну відповідь:",
                    "а) W = 880 кВт •год., П = 5866,66 гривень;",
                    "б) W = 1600 кВт•год., П = 240 гривень;",
                    "в) W = 880 кВт •год., П = 132 гривені;",
                    "г) W = 1200 кВт •год., П = 180 гривень.",
                    "none",
                    "none"
                },
                { // question 5.5
                    "Вкажіть  правильне визначення другого закону Кірхгофа . " +
                        "Алгебраїчна  сума  ЕРС контура дорівнює:",
                    "а) Алгебраїчній  сумі  струмів контура;",
                    "б) Алгебраїчній  сумі  спаду напруг на елементах  контура;",
                    "в) Алгебраїчній сумі спаду ЕРС контура;",
                    "г) Алгебраїчній сумі струмів, що входять у вузол.",
                    "none",
                    "none"
                },
                { // question 5.6
                    "Визначити ЕРС Е електричного кола постійного струму,  якщо струм І1= 30 А, R1 = 4 Ом, " +
                        "R2 = R3 =  6 Ом, R4 = R5 =  3 Ом. Вкажіть правильну відповідь:",
                    "а) 50 В;",
                    "б) 78 В;",
                    "в) 120 В;",
                    "г) 60 В.",
                    "none",
                    "quest_5_6"
                },
                { // question 5.7
                    "Яке з приведених рівнянь відповідає рисунку? Вкажіть  правильну відповідь:",
                    "а) I1 + I2 + I4 = I3;",
                    "б) I1 - I2 - I3 = - I4;",
                    "в) I3 + I4 - I1 - I2 = 0;",
                    "г) I1 + I2 + I3 + I4 = 0.",
                    "none",
                    "quest_4_6"
                },
                { // question 5.8
                    "Яке з приведених рівнянь відповідає даній електричній схемі (контур 1)? " +
                        "Вкажіть  правильну відповідь:",
                    "а) I1 R1 + I5 R5 – I3 R3 = E1;",
                    "б) – I1 (R1 + R3) - I5 R5 – I3 R3 = E1;",
                    "в) – I1 R1 + I5 (R2 + R4 + R5)  = E1;",
                    "г) I2 (R2 + R4) – I5 R5 – I1 (R1 + R3) = – E2.",
                    "none",
                    "quest_5_8"
                }
            },
            { // variant 6
                { // question 6.1
                    "У замкнутому електричному колі спад напруги на внутрішньому опорі джерела постійного " +
                        "струму URВ = 4 В. ЕРС джерела 40 В. Опір навантаження R1 = 18 Ом. " +
                        "Визначити покази вольтметра при розімкненому і замкнутому вимикачі S1, " +
                        "струм короткого замикання .",
                    "а) UV S1-розім. = 36В, UV S1-замк. = 40В, Iкз = 10А;",
                    "б) UV S1-розім. = 40В, UV S1-замк. = 36В, Iкз = 40А;",
                    "в) UV S1-розім. = 40В, UV S1-замк. = 36В, Iкз = 20А;",
                    "г) UV S1-розім. = 44В, UV S1-замк. = 40В, Iкз = 2А.",
                    "none",
                    "quest_2_2"
                },
                { // question 6.2 
                    "Визначити еквівалентний опір електричної схеми постійного струму й ЕРС та покази " +
                        "амперметра А1, вольтметра, якщо  RВ = 2 Ом;  R1 =  R2 = 8 Ом; Р = 100 Вт. " +
                        "Вкажіть  правильну відповідь:",
                    "а) І = 5А, U = 20 В, Е = 30 В, RЕ = 6 Ом ;",
                    "б) І = 4А, U = 10 В, Е = 30 В, RЕ = 4 Ом;",
                    "в) І = 2,5А, U = 20 В, Е = 40 В, RЕ = 18 Ом;",
                    "г) І = 10А, U = 30 В, Е = 20 В, RЕ = 8 Ом;",
                    "д) І = 5А, U = 10 В, Е = 30 В, RЕ = 6 Ом.",
                    "quest_5_2"
                },
                { // question 6.3
                    "Визначити еквівалентний опір електричної схеми постійного струму до і після " +
                        "ввімкнення вимикача S1, якщо R1 = 4 Ом, R2 = R3 = R4 = 12 Ом. ",
                    "а) 30 Ом,8 Ом;",
                    "б) 48 Ом,16 Ом;",
                    "в) 16 Ом,8 Ом;",
                    "г) 3 Ом,12 Ом.",
                    "none",
                    "quest_3_5"
                },
                { // question 6.4
                    "Яку кількість рівнянь необхідно скласти для даного електричного кола за першим й " +
                        "другим законом законом Кірхгофа? Вкажіть  правильну відповідь:",
                    "а)  4, 3;",
                    "б)  3, 3;",
                    "в)  6, 3;",
                    "г)  8, 4 ",
                    "none",
                    "quest_5_8"
                },
                { // question 6.5
                    "Потужність кожної лампи Р = 40 Вт. Визначити потужність, яку споживає електричне коло " +
                        "постійного струму. Вимикач S1- ввімкнений. Потужність, яка витрачається на " +
                        "внутрішньому опорі джерела живлення не враховувати.Вкажіть правильну відповідь:",
                    "а) Р = 120 Вт;",
                    "б) Р = 160 Вт;",
                    "в) Р = 40 Вт;",
                    "г) Р = 80 Вт.",
                    "none",
                    "quest_4_7"
                },
                { // question 6.6
                    "Якими даними необхідно володіти, щоб визначити довжину витка дроту, не розмотуючи його? " +
                        "Вкажіть  правильну відповідь:",
                    "а) U, I, S;",
                    "б) U, S, ρ;",
                    "в) I, S, ρ;",
                    "г) U, I, S, ρ.",
                    "none",
                    "none"
                },
                { // question 6.7
                    "Яке з приведених рівнянь відповідає рисунку? Вкажіть  правильну відповідь:",
                    "а) I1 + I2 = I3 + I4 + I5;",
                    "б) I1 + I2 - I3 = - I4 + I5;",
                    "в) - I1 - I2  - I3 - I4 + I5 = 0;",
                    "г) I3 + I4 - I1 - I2 + I5 = 0.",
                    "none",
                    "quest_6_7"
                },
                { // question 6.8
                    "Яке з приведених рівнянь відповідає даній електричній схемі (контур 2)? Вкажіть  правильну відповідь:",
                    "а) I1 (R1 + R3) + I5 R5 = E1;",
                    "б) I1 (R1 + R3 + R5) – I5 R5 = E2;",
                    "в) I1 R1 + I5 (R2 + R4 + R5)  = E1;",
                    "г)  I2 (R2 + R4) – I5 R5 = –E2.",
                    "none",
                    "quest_1_7"
                }
            }
        };

        char[] GetAnswer = new char[8];
        char[,] GoodAnswers =
        {
            {'а','б','д','а','а','б','г','г'}, // variant 1
            {'а','а','а','а','д','б','в','г'}, // variant 2
            {'а','а','г','а','в','б','а','г'}, // variant 3
            {'а','д','д','б','г','а','а','г'}, // variant 4
            {'а','а','а','б','б','г','а','а'}, // variant 5
            {'в','а','в','б','б','г','в','г'}  // variant 6
        };
        public TestWindow()
        {
            InitializeComponent();
            RadioButton[] Buttons = { RadionButtonAnswer1, RadioButtonAnswer2,
                RadioButtonAnswer3, RadioButtonAnswer4, RadioButtonAnswer5};
            Data["Variant"] = rnd.Next(6);
            ChangeQuestion(Data["Variant"], Data["Question"], Buttons, LabelQuestion, PictureQuestion);
        }

        public void ChangeQuestion(int Variant, int Question, RadioButton[] Buttons, Label Title, PictureBox Picture)
        {
            if (Data["Question"] < 8)
            {
                Title.Text = questions[Variant, Question, 0];
                for (int i = 1; i < 6; i++)
                {
                    if (questions[Variant, Question, i] == "none")
                    {
                        Buttons[i - 1].Visible = false;
                    }
                    else
                    {
                        if (!Buttons[i - 1].Visible) { Buttons[i - 1].Visible = true; }
                        Buttons[i - 1].Text = questions[Variant, Question, i];
                    }
                }
                if (questions[Variant, Question, 6] != "none")
                {
                    if (!Picture.Visible) { Picture.Visible = true; }
                    Picture.Image = Properties.Resources.ResourceManager.GetObject(
                        questions[Variant, Question, 6]) as Image;
                }
                else
                {
                    Picture.Visible = false;
                }
            }
        }

        private void ButtonNext_Click(object sender, EventArgs e)
        {
            RadioButton[] Buttons = { RadionButtonAnswer1, RadioButtonAnswer2,
                RadioButtonAnswer3, RadioButtonAnswer4, RadioButtonAnswer5};
            if (Data["Question"] < 8)
            {
                CheckAnswer('w', Data["Question"], Buttons);
                if (Data["Question"] == 6)
                {
                    Data["Question"] += 1;
                    ButtonNext.Text = "Закінчити";
                }
                else
                {
                    if (!ButtonBack.Visible) { ButtonBack.Visible = true; };
                    Data["Question"] += 1;
                }
                ChangeQuestion(Data["Variant"], Data["Question"], Buttons, LabelQuestion, PictureQuestion);
            } else if (Data["Question"] == 8)
            {
                PanelQuestion.Controls.Clear();
                int Result = GetResult(GetAnswer, GoodAnswers, Data["Variant"]);
                Label ResultLabel = new Label();
                PanelQuestion.Controls.Add(ResultLabel);
                ResultLabel.Location = new Point(250, 100);
                ResultLabel.Size = new Size(300, 200);
                ResultLabel.TextAlign = ContentAlignment.MiddleCenter;
                ResultLabel.Text = "Ви закінчили тест.\nВаш результат: " + Convert.ToString(Result) + "/8. " +
                    "Це " + ((Result*100)/8) + "% правильних відповідей";

            }
        }

        private void ButtonBack_Click(object sender, EventArgs e)
        {
            RadioButton[] Buttons = { RadionButtonAnswer1, RadioButtonAnswer2,
                RadioButtonAnswer3, RadioButtonAnswer4, RadioButtonAnswer5};
            if (Data["Question"] == 1)
            {
                Data["Question"] -= 1;
                ButtonBack.Visible = false;
            }
            else
            {
                if (ButtonNext.Text == "Закінчити") { ButtonNext.Text = "Наступне"; }
                Data["Question"] -= 1;
            }
            CheckAnswer('c', Data["Question"], Buttons);
            ChangeQuestion(Data["Variant"], Data["Question"], Buttons, LabelQuestion, PictureQuestion);
        }

        private void CheckAnswer(char Type,int Question, RadioButton[] Buttons)
        {
            char[] Letter = { 'а', 'б', 'в', 'г', 'д' };
            if (Type == 'w')
            {
                for (int i = 0; i < 5; i++)
                {
                    if (Buttons[i].Checked) { GetAnswer[Question] = Letter[i]; }
                }
            } else if (Type == 'c')
            {
                for (int i =0; i < 5; i++)
                {
                    if (Letter[i] == GetAnswer[Question])
                    {
                        Buttons[i].Checked = true;
                    }
                }
            }
        }

        private int GetResult(char[] Answers, char[,] GoodAnswers, int Variant)
        {
            int result = 0;
            for (int i =0; i < 8; i++)
            {
                if (Answers[i] == GoodAnswers[Variant,i]) { result++; }
            }
            return result;
        }
    }
}
