using Testings;

namespace Laboratory_work__1.forms
{
    public partial class TestWindowFirstLab : Form
    {

        Random rnd = new Random();

        Testing Testing = new Testing();

        Dictionary<string, int> Data = new Dictionary<string, int>()
        {
            { "Variant", 1 },
            { "Question", 0 },
            { "GoodAnswer", 0 },
            { "Range", 16 },
            { "Answers", 5 }
        };

        string[,,] questions = {
            { // variant 1
                { // question 1.1
                    "1. Електричний струм - це:",
                    "a) Спрямований рух електронів чи протонів;",
                    "б) Спрямований рух носіїв електрич¬них зарядів;",
                    "в) Струм, який не змінюється з часом за значенням та напрямом;",
                    "г) Струм, який змінюється з часом за значенням та напрямо.",
                    "none"
                },
                { // question 1.2
                    "2. На електричному приладі вказано значок (електромагнітна система). І такі прилади застосовувати тільки в колах змінного струму?",
                    "а) Так;",
                    "б) Ні;",
                    "в) Можна застосовувати в колах постійного і змінного струму;",
                    "г) Правильної відповіді немає;",
                    "quest_1_1_2"
                },
                { // question 1.3
                    "3. Електри́чна потужність або потужність електричного струму – це:",
                    "а) Фізична величина, що характеризує швидкість зміни електричної енергії електричного поля;",
                    "б) Фізична величина, що характеризує швидкість передавання або перетворення електричної енергії;",
                    "в) Фізична величина, що характеризує швидкість зміни електричної енергії магнітного поля;",
                    "г) Правильної відповіді немає.",
                    "none"
                },
                { // question 1.4
                    "4. Вкажіть вираз для визначення  електри́чної потужності.",
                    "а) P = I^2 * R * t = (U^2)/R = U^2 * G (Ват) ;",
                    "б) P = I^2 * R = U^2 * R = U^2 * G (Вт);",
                    "в) P = I^2 * R = U^2 / R = U^2 * G;",
                    "г) W = U * l * t = I^2 * R * t;",
                    "none"
                },
                { // question 1.5
                    "5. Ємність конденсатора визначається за формулою:",
                    "а) C = U * I;",
                    "б) C = U / Q;",
                    "в) C = Q * U;",
                    "г) C = Q / U;",
                    "none"
                },
                { // question 1.6
                    "6. Вкажіть схему правильного ввімкнення вимірювальних приладів (амперметра,  вольтметра,  ватметра)  в електричне коло (для вимірювання потужності опорів R1, R2). Вкажіть  правильну відповідь:",
                    "а) Рисунок 1;",
                    "б) Рисунок 2;",
                    "в) Вірної відповіді немає;",
                    "г) Рисунок 3;",
                    "quest_2_1_4"
                },
                { // question 1.7
                    "7. Конденсатор – це: ",
                    "а) Елемент, який служить для накопичення енергії електричного поля;",
                    "б) Елемент, який служить для обмеження або регулювання накопичення енергії електричного поля;",
                    "в) Елемент, який служить для обмеження або регулювання сили струму в електричному колі;",
                    "г) Правильної відповіді немає.",
                    "none"
                },
                { // question 1.8
                    "8. Вкажіть, який елемент зображено на рисунку 8, ж. ",
                    "а) Резистор;",
                    "б) Конденсатор постійної ємності;",
                    "в) Електролічний конденсатор;",
                    "г) Котушка індуктивності;",
                    "quest_1_1_8"
                },
                { // question 1.9
                    "9. Закон Ома для повного кола записується так:",
                    "а) I = E / ( Rв + Rн );",
                    "б) I = ( Rв + Rн ) / E;",
                    "в) I = R / U;",
                    "г) I = E * ( Rв + Rн );",
                    "none"
                },
                { // question 1.10
                    "10. Три електричних прилади (праску, порохотяг, чайник) ввімкнули через розетку (розмножувач – трійник) в мережу живлення  220 В. Які з наведених тверджень вірні? 1 - у всіх трьох приладах протікає однаковий струм; 2 - прилади з’єднані послідовно; 3 – прилади з’єднані паралельно; \r\n4 – усі три прилади ввімкнені на однакову напругу мережі живлення\r\n",
                    "а) 1 і 4;",
                    "б) 1 і 3;",
                    "в) 2 і 4;",
                    "г) 3 і 4;",
                    "none"
                },
                { // question 1.11
                    "11. До акумуляторної  батареї із внутрішнім опором RВ = 0,6 Ом ввімкнули лампу розжарювання з опором RЛ = 11,4 Ом. Струм в колі дорівнює 2,5 А. Визначити ЕРС акумулятора і напругу на клемах лампи розжарювання.",
                    "а) Е1 = 60 В, U  = 56 В, Iк з = 150 А;",
                    "б) Е1 = 40 В,   U  = 35 В,  Iк з = 50 А;",
                    "в) Е1 = 30 В, U  = 28,5 В, Iк з = 50 А;",
                    "г) U  = 208 В,   І  = 10 А, Iк з = 120 А;",
                    "quest_2_1_1"
                },
                { // question 1.12
                    "12. Визначте загальний опір електричного кола зображеного на рисунку 12. Вольтметри ідеальні.",
                    "а) Rе = 220 Ом;",
                    "б) Rе = 270 Ом;",
                    "в) Rе = 61,25 Ом;",
                    "г) Rе = 55 Ом;",
                    "quest_1_1_12"
                },
                { // question 1.13
                    "13. За добу лічильник показав, що дане електричне коло споживає 1,2 кВт· год. Визначте силу струму в колі та потужність лампи Л1.",
                    "а) РЛ1 = 50 Вт, І = 0,5 А;",
                    "б) РЛ1 = 25 Вт, І = 0,5 А;",
                    "в) РЛ1 = 1,2 кВт, І = 12 А;",
                    "г) РЛ1 = 25 Вт, І = 1 А.",
                    "quest_1_1_13"
                },
                { // question 1.14
                    "14. Вкажіть вираз для визначення еквівалентного опору даного електричного кола.",
                    "а) RЕ = (RЛ 1 · RЛ 2) + RЛ;",
                    "б) RЕ = (RЛ 1 + RЛ 2 + RЛ)/ (RЛ 1 · RЛ 2);",
                    "в) RЕ = RЛ 1 + RЛ 2 + RЛ;",
                    "г) RЕ = ((RЛ 1 · RЛ 2) /(RЛ 1 + RЛ 2)) + RЛ.",
                    "quest_1_1_14"
                },
                { // question 1.15
                    "15. Визначити ЕРС Е джерела живлення в електричному колі, загальний опір Rе, якщо вимикач  S1  розімкнений, потужність кожної лампи Р = 100 Вт, U = 200 В. Внутрішній опір джерела живлення RВ = 0,67 Ом.",
                    "а) Е = 201 В,   Rе = 134 Ом;",
                    "б) Е = 150 В,   Rе = 125 Ом;",
                    "в) Е = 200 В,   Rе = 250 Ом;",
                    "г) Е = 33,2 В,   Rе = 83 Ом.",
                    "quest_2_4_7"
                },
                { // question 1.16
                    "16. Визначити значення ЕРС Е електричного кола постійного струму , якщо RВ = 2,5 Ом, R1 = R3 = 4 Ом, R2 = R4 = 6 Ом. Вольтметр показує напругу U4  = 24 B. Вкажіть правильну відповідь:",
                    "а) Е = 60 В;",
                    "б) Е = 18 В;",
                    "в) Е = 90 В;",
                    "г) Е = 36 В;",
                    "quest_1_1_16"
                }
            },
            { // variant 2
                { // question 2.1
                    "1. Напруга – це",
                    "а) Різниця потенціалів між двома точками електричного кола;",
                    "б) Частина кола, що характеризує електричне поле;",
                    "в) Частина кола, що характеризує магнітне поле;",
                    "г) Правильної відповіді немає;",
                    "none"
                },
                { // question 2.2
                    "2. На електричних приладах вказані значки  (магнітоелектрична система) ,  (електромагнітна система).  Який з приладів можна застосовувати в колах змінного струму?",
                    "а) Магнітоелектричної системи;",
                    "б) Електромагнітної системи;",
                    "в) Обидва прилади можна застосовувати в колах змінного струму;",
                    "г) Правильної відповіді немає;",
                    "quest_1_2_2"
                },
                { // question 2.3
                    "3. Розрізняють характерні режими роботи джерела живлення:",
                    "а) Номінальний; узгоджений;",
                    "б) Номінальний; неробочий;",
                    "в) Номінальний; неробочий; короткого замикання; узгоджений;",
                    "г) Номінальний; неробочий; короткого замикання;",
                    "none"
                },
                { // question 2.4
                    "4. Вкажіть вираз для визначення кількості спожитої енергії та показ лічильника за добу, якщо потужність споживача дорівнює 1кВт",
                    "а) W = U * I = I^2 * R (кВт*год), 2400 Вт*год;",
                    "б) W = U * I * t = I^2 * R * t (кВт*год), 24 кВт*год;",
                    "в) P = I^2 * R = U^2 * R = U^2 * G (Вт), 24 кВт;",
                    "г) P = I^2 * R = U^2 * R = U^2 * G (Вт), 2400 Вт;",
                    "none"
                },
                { // question 2.5
                    "5. Вкажіть вираз для визначення опору провідника.",
                    "а) R = U / I;",
                    "б) R = ( E - I * Rв  ) / I;",
                    "в) R = ro * l / S;",
                    "г) Правильної відповіді немає;",
                    "none"
                },
                { // question 2.6
                    "6. Напруга пробою ізоляції визначається за формулою:",
                    "а) U = E * l;",
                    "б) U = E * d;",
                    "в) U = A / q;",
                    "г) U = F / q;",
                    "none"
                },
                { // question 2.7
                    "7. Котушка індуктивності – це",
                    "а) Елемент, який служить для обмеження або регулювання накопичення енергії електричного поля;",
                    "б) Елемент, який служить для накопичення енергії магнітного поля;",
                    "в) Елемент, який служить для обмеження або регулювання сили струму в електричному колі;",
                    "г) Правильної відповіді немає;",
                    "none"
                },
                { // question 2.8
                    "8. Вкажіть, який елемент зображено на рисунку 8 д.",
                    "а) Резистор;",
                    "б) Конденсатор постійної ємності;",
                    "в) Реостат;",
                    "г) Котушка індуктивності;",
                    "quest_1_1_8"
                },
                { // question 2.9
                    "9. Вкажіть   схему   правильного ввімкнення   приладів   вимірювання (амперметра і вольтметра) в електричне коло. ",
                    "а) Рисунок 9.2;",
                    "б) Рисунок 9.1,9.3;",
                    "в) Рисунок 9.1;",
                    "г) Рисунок 9.3;",
                    "quest_1_2_9"
                },
                { // question 2.10
                    "10. Закон Ома для ділянки кола формулюється так:",
                    "а) Сила струму в колі прямо пропорційна ЕРС джерела живлення й обернено пропорційна сумі опорів зовнішньої та внутрішньої частин кола;",
                    "б) Сила струму на ділянці кола прямо пропорційна спаду напруги на цій ділянці й обернено пропорційна її опору;",
                    "в) Алгебраїчна суму струмів у вузлі електричного кола дорівнює нулю;",
                    "г) Сила струму на ділянці кола прямо пропорційна опору й обернено пропорційна спаду напруги на  цій ділянці;",
                    "none"
                },
                { // question 2.11
                    "11. В електричному колі постійного струму при розімкненому вимикачі S1 покази вольтметра дорівнюють 12 В, а при замкнутому – 10 В. Покази амперметра І = 2 А. Визначити опір навантаження R1,  струм короткого замикання Iк з.",
                    "а) R1 = 5 Ом, Ikz = 12 А;",
                    "б) R1 = 4 Ом, Ikz = 2 А;",
                    "в) R1 = 10 Ом, Ikz = 1 А;",
                    "г) R1 = 15 Ом, Ikz = 10 А;",
                    "quest_1_2_11"
                },
                { // question 2.12
                    "12. Вкажіть вираз для визначення еквівалентного опору даного електричного кола.",
                    "а) Rе = Rл1 · Rл2;",
                    "б) Rе = Rл1 - Rл2;",
                    "в) Rе = Rл1 + Rл2;",
                    "г) Rе = (Rл1 + Rл2)/ (Rл1 · Rл2);",
                    "quest_1_1_12"
                },
                { // question 2.13
                    "13. За добу лічильник показав, що дане електричне коло споживає 1,2 кВт· год. Визначте загальний опір електричного кола, та потужність лампи Л1.",
                    "а) Рл1 = 50 Вт, R = 400 Ом;",
                    "б) Рл1 = 25 Вт, R = 200 Ом;",
                    "в) Рл1 = 1,2 кВт, R = 270 Ом;",
                    "г) Рл1 = 25 Вт, R = 100 Ом;",
                    "quest_1_1_13"
                },
                { // question 2.14
                    "14. За добу лічильник показав, що дане електричне коло споживає 3 кВт· год. Визначте загальний опір електричного кола, та потужність лампи Л1.",
                    "а) Рл1 = 50 Вт, Rе = 125 Ом;",
                    "б) Рл1 = 25 Вт, Rе = 200 Ом;",
                    "в) Рл1 = 1,2 кВт, Rе = 270 Ом;",
                    "г) Рл1 = 25 Вт, Rе = 100 Ом;",
                    "quest_1_1_14"
                },
                { // question 2.15
                    "15. Визначити покази амперметра А1 і  вольтметра, якщо ЕРС Е = 120 В, RВ = 10 Ом, R1= 40 Ом, R2 = 40 Ом ",
                    "а) І1 = 4 А, U = 80 В, Р = 320 Вт;",
                    "б) І1 = 10 А, U = 100 В, Р = 1000 Вт;",
                    "в) І1 = 5 А, U  = 60 В, Р = 300 Вт;",
                    "г) І1 = 1 А, U  = 100 В, Р = 100 Вт;",
                    "quest_2_5_2"
                },
                { // question 2.16
                    "16. Визначити ЕРС Е електричного кола постійного струму, якщо струм І1= 20А, R1 = 4 Ом, R2 = R3 =6 Ом, R4 = R5 = 3 Ом. Вкажіть правильну відповідь:",
                    "а) 50 В;",
                    "б) 78 В;",
                    "в) 120 В;",
                    "г) 40 В;",
                    "quest_2_5_6"
                },
            }
        };

        char[,] GoodAnswers =
        {
            { 'б','в','б','в','г','б','а','г','а','г','в','б','б','г','а','а','d' },
            { 'а','б','в','б','в','б','б','в','в','б','а','в','б','б','а','г','d' }
        };

        char[] Answers = new char[17]; 

        public TestWindowFirstLab()
        {
            InitializeComponent();
            RadioButton[] Buttons = { RadionButtonAnswer1, RadioButtonAnswer2,
                RadioButtonAnswer3, RadioButtonAnswer4};
            Data["Variant"] = rnd.Next(1);
            Testing.ChangeQuestion(Data, questions, Buttons, LabelQuestion, PictureQuestion);
        }

        private void ButtonNext_Click(object sender, EventArgs e)
        {
            RadioButton[] Buttons = { RadionButtonAnswer1, RadioButtonAnswer2,
                RadioButtonAnswer3, RadioButtonAnswer4};

            if (Data["Question"] < Data["Range"])
            {
                if (Data["Question"] == Data["Range"]-1)
                {
                    Data["Question"] += 1;
                    ButtonNext.Text = "Закінчити";
                }
                else
                {
                    Testing.CheckAnswer('w', Data, Answers, Buttons);
                    if (!ButtonBack.Visible) { ButtonBack.Visible = true; };
                    Data["Question"] += 1;
                    if (Data["Question"] < Data["Range"]) { Testing.CheckAnswer('c', Data, Answers, Buttons); }
                }
                Testing.ChangeQuestion(Data, questions, Buttons, LabelQuestion, PictureQuestion);
            }
            else if (Data["Question"] == Data["Range"])
            {
                PanelQuestion.Controls.Clear();
                int Result = Testing.GetResult(Answers, GoodAnswers, Data);
                Label ResultLabel = new Label();
                PanelQuestion.Controls.Add(ResultLabel);
                ResultLabel.Location = new Point(250, 100);
                ResultLabel.Size = new Size(300, 200);
                ResultLabel.TextAlign = ContentAlignment.MiddleCenter;
                ResultLabel.Text = "Ви закінчили тест.\nВаш результат: " + Convert.ToString(Result) + "/" + Convert.ToString(Data["Range"]) + ". " +
                    "Це " + ((Result * 100) / (Data["Range"])) + "% правильних відповідей";
            }
        }

        private void ButtonBack_Click(object sender, EventArgs e)
        {
            RadioButton[] Buttons = { RadionButtonAnswer1, RadioButtonAnswer2,
                RadioButtonAnswer3, RadioButtonAnswer4};
            if (Data["Question"] == 1)
            {
                Data["Question"] -= 1;
                ButtonBack.Visible = false;
            }
            else
            {
                if (ButtonNext.Text == "Закінчити") { ButtonNext.Text = "Наступне"; }
                Data["Question"] -= 1;
            }
            Testing.CheckAnswer('c', Data, Answers, Buttons);
            Testing.ChangeQuestion(Data, questions, Buttons, LabelQuestion, PictureQuestion);
        }
    }
}
